README.md
```mermaid
sequenceDiagram
    actor TC as Tunneling Client
    box rgb(222, 235, 247) Public Tunneling Server
        participant WS as WebSocket Handler
        participant TL as TCP Listener
    end
    actor EC as External Client

    TC->>WS: Connect via WebSocket
    TC->>WS: Register tunnel request
    WS->>TL: Start listening on random port
    TL-->>WS: Port number
    WS-->>TC: Tunnel registered (port number)

    Note over TC,EC: Some time later

    EC->>TL: Connect to generated port
    TL->>WS: New TCP connection
    WS-->>TC: Notify of new TCP connection
    TC->>WS: Begin tunneling data
    WS<<->>TC: Bi-directional data transfer
    TL<<->>EC: Bi-directional data transfer
```
